In [2]:
import pandas as pd

df=pd.DataFrame({'x3':[1,2,3,4,5,6],'x2':[9,8,7,6,5,4],'x1':[22,34,56,23,12,32]})
df

   x3  x2  x1
0   1   9  22
1   2   8  34
2   3   7  56
3   4   6  23
4   5   5  12
5   6   4  32

In [10]:
df1=df.sort_index(axis=1)
df1

   x1  x2  x3
0  22   9   1
1  34   8   2
2  56   7   3
3  23   6   4
4  12   5   5
5  32   4   6

In [13]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.arange(36).reshape(6,6))
df

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [18]:
missing=np.nan

df.loc[0:1,0:1]=missing
df

      0     1     2   3   4   5
0   NaN   NaN   NaN   3   4   5
1   NaN   NaN   NaN   9  10  11
2   NaN   NaN   NaN  15  16  17
3   NaN   NaN   NaN  21  22  23
4  24.0  25.0  26.0  27  28  29
5  30.0  31.0  32.0  33  34  35

In [19]:
df.dropna()

      0     1     2   3   4   5
4  24.0  25.0  26.0  27  28  29
5  30.0  31.0  32.0  33  34  35

In [20]:
df.fillna(method='bfill')

      0     1     2   3   4   5
0  24.0  25.0  26.0   3   4   5
1  24.0  25.0  26.0   9  10  11
2  24.0  25.0  26.0  15  16  17
3  24.0  25.0  26.0  21  22  23
4  24.0  25.0  26.0  27  28  29
5  30.0  31.0  32.0  33  34  35

In [21]:
df.fillna({0:12,1:14,2:23})

      0     1     2   3   4   5
0  12.0  14.0  23.0   3   4   5
1  12.0  14.0  23.0   9  10  11
2  12.0  14.0  23.0  15  16  17
3  12.0  14.0  23.0  21  22  23
4  24.0  25.0  26.0  27  28  29
5  30.0  31.0  32.0  33  34  35

In [23]:
series=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
series[['d','e']]

d    4
e    5
dtype: int64

In [25]:
import numpy as np
arr=np.array([1,2,3,4])
arr

array([1, 2, 3, 4])

In [26]:
arr[0]

1

In [27]:
arr[0:2]

array([1, 2])

In [28]:
arr=np.array([[1,2,3],[4,5,6]])
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [36]:
arr[0:1]

array([[1, 2, 3]])

In [43]:
arr[1][1:3]

array([5, 6])

In [49]:
arr[0:2,:]

array([[1, 2, 3],
       [4, 5, 6]])

In [51]:
arr[:,1:3]

array([[2, 3],
       [5, 6]])

In [55]:
a=5//2
print(a)

2